FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_sysctrl.h
/**
 * \file
 *
 * \brief Component description for SYSCTRL
 *
 * Copyright (c) 2013 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMD20_SYSCTRL_COMPONENT_
#define _SAMD20_SYSCTRL_COMPONENT_

/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR SYSCTRL */
/* ========================================================================== */
/** \addtogroup SAMD20_SYSCTRL System Control */
/*@{*/

#define REV_SYSCTRL    0x200

/* -------- SYSCTRL_INTENCLR : (SYSCTRL Offset: 0x00) (R/W 32) Interrupt Enable Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t XOSCRDY : 1;    /*!< bit:      0  XOSC Ready                         */
            uint32_t XOSC32KRDY : 1; /*!< bit:      1  XOSC32K Ready                      */
            uint32_t OSC32KRDY : 1;  /*!< bit:      2  OSC32K Ready                       */
            uint32_t OSC8MRDY : 1;   /*!< bit:      3  OSC8M Ready                        */
            uint32_t DFLLRDY : 1;    /*!< bit:      4  DFLL Ready                         */
            uint32_t DFLLOOB : 1;    /*!< bit:      5  DFLL Out Of Bounds                 */
            uint32_t DFLLLCKF : 1;   /*!< bit:      6  DFLL Lock Fine                     */
            uint32_t DFLLLCKC : 1;   /*!< bit:      7  DFLL Lock Coarse                   */
            uint32_t DFLLRCS : 1;    /*!< bit:      8  DFLL Reference Clock Stopped       */
            uint32_t BOD33RDY : 1;   /*!< bit:      9  BOD33 Ready                        */
            uint32_t BOD33DET : 1;   /*!< bit:     10  BOD33 Detection                    */
            uint32_t B33SRDY : 1;    /*!< bit:     11  BOD33 Synchronization Ready        */
            uint32_t BOD12RDY : 1;   /*!< bit:     12  BOD12 Ready                        */
            uint32_t BOD12DET : 1;   /*!< bit:     13  BOD12 Detection                    */
            uint32_t B12SRDY : 1;    /*!< bit:     14  BOD12 Synchronization Ready        */
            uint32_t : 17;           /*!< bit: 15..31  Reserved                           */
        } bit;                       /*!< Structure used for bit  access                  */
        uint32_t reg;                /*!< Type      used for register access              */
    } SYSCTRL_INTENCLR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SYSCTRL_INTENCLR_OFFSET            0x00        /**< \brief (SYSCTRL_INTENCLR offset) Interrupt Enable Clear Register */
#define SYSCTRL_INTENCLR_RESETVALUE        0x00000000  /**< \brief (SYSCTRL_INTENCLR reset_value) Interrupt Enable Clear Register */

#define SYSCTRL_INTENCLR_XOSCRDY_Pos       0           /**< \brief (SYSCTRL_INTENCLR) XOSC Ready */
#define SYSCTRL_INTENCLR_XOSCRDY           ( 0x1u << SYSCTRL_INTENCLR_XOSCRDY_Pos )
#define SYSCTRL_INTENCLR_XOSC32KRDY_Pos    1           /**< \brief (SYSCTRL_INTENCLR) XOSC32K Ready */
#define SYSCTRL_INTENCLR_XOSC32KRDY        ( 0x1u << SYSCTRL_INTENCLR_XOSC32KRDY_Pos )
#define SYSCTRL_INTENCLR_OSC32KRDY_Pos     2           /**< \brief (SYSCTRL_INTENCLR) OSC32K Ready */
#define SYSCTRL_INTENCLR_OSC32KRDY         ( 0x1u << SYSCTRL_INTENCLR_OSC32KRDY_Pos )
#define SYSCTRL_INTENCLR_OSC8MRDY_Pos      3           /**< \brief (SYSCTRL_INTENCLR) OSC8M Ready */
#define SYSCTRL_INTENCLR_OSC8MRDY          ( 0x1u << SYSCTRL_INTENCLR_OSC8MRDY_Pos )
#define SYSCTRL_INTENCLR_DFLLRDY_Pos       4           /**< \brief (SYSCTRL_INTENCLR) DFLL Ready */
#define SYSCTRL_INTENCLR_DFLLRDY           ( 0x1u << SYSCTRL_INTENCLR_DFLLRDY_Pos )
#define SYSCTRL_INTENCLR_DFLLOOB_Pos       5           /**< \brief (SYSCTRL_INTENCLR) DFLL Out Of Bounds */
#define SYSCTRL_INTENCLR_DFLLOOB           ( 0x1u << SYSCTRL_INTENCLR_DFLLOOB_Pos )
#define SYSCTRL_INTENCLR_DFLLLCKF_Pos      6           /**< \brief (SYSCTRL_INTENCLR) DFLL Lock Fine */
#define SYSCTRL_INTENCLR_DFLLLCKF          ( 0x1u << SYSCTRL_INTENCLR_DFLLLCKF_Pos )
#define SYSCTRL_INTENCLR_DFLLLCKC_Pos      7           /**< \brief (SYSCTRL_INTENCLR) DFLL Lock Coarse */
#define SYSCTRL_INTENCLR_DFLLLCKC          ( 0x1u << SYSCTRL_INTENCLR_DFLLLCKC_Pos )
#define SYSCTRL_INTENCLR_DFLLRCS_Pos       8           /**< \brief (SYSCTRL_INTENCLR) DFLL Reference Clock Stopped */
#define SYSCTRL_INTENCLR_DFLLRCS           ( 0x1u << SYSCTRL_INTENCLR_DFLLRCS_Pos )
#define SYSCTRL_INTENCLR_BOD33RDY_Pos      9           /**< \brief (SYSCTRL_INTENCLR) BOD33 Ready */
#define SYSCTRL_INTENCLR_BOD33RDY          ( 0x1u << SYSCTRL_INTENCLR_BOD33RDY_Pos )
#define SYSCTRL_INTENCLR_BOD33DET_Pos      10          /**< \brief (SYSCTRL_INTENCLR) BOD33 Detection */
#define SYSCTRL_INTENCLR_BOD33DET          ( 0x1u << SYSCTRL_INTENCLR_BOD33DET_Pos )
#define SYSCTRL_INTENCLR_B33SRDY_Pos       11          /**< \brief (SYSCTRL_INTENCLR) BOD33 Synchronization Ready */
#define SYSCTRL_INTENCLR_B33SRDY           ( 0x1u << SYSCTRL_INTENCLR_B33SRDY_Pos )
#define SYSCTRL_INTENCLR_BOD12RDY_Pos      12          /**< \brief (SYSCTRL_INTENCLR) BOD12 Ready */
#define SYSCTRL_INTENCLR_BOD12RDY          ( 0x1u << SYSCTRL_INTENCLR_BOD12RDY_Pos )
#define SYSCTRL_INTENCLR_BOD12DET_Pos      13          /**< \brief (SYSCTRL_INTENCLR) BOD12 Detection */
#define SYSCTRL_INTENCLR_BOD12DET          ( 0x1u << SYSCTRL_INTENCLR_BOD12DET_Pos )
#define SYSCTRL_INTENCLR_B12SRDY_Pos       14          /**< \brief (SYSCTRL_INTENCLR) BOD12 Synchronization Ready */
#define SYSCTRL_INTENCLR_B12SRDY           ( 0x1u << SYSCTRL_INTENCLR_B12SRDY_Pos )
#define SYSCTRL_INTENCLR_MASK              0x00007FFFu /**< \brief (SYSCTRL_INTENCLR) MASK Register */

/* -------- SYSCTRL_INTENSET : (SYSCTRL Offset: 0x04) (R/W 32) Interrupt Enable Set Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t XOSCRDY : 1;    /*!< bit:      0  XOSC Ready                         */
            uint32_t XOSC32KRDY : 1; /*!< bit:      1  XOSC32K Ready                      */
            uint32_t OSC32KRDY : 1;  /*!< bit:      2  OSC32K Ready                       */
            uint32_t OSC8MRDY : 1;   /*!< bit:      3  OSC8M Ready                        */
            uint32_t DFLLRDY : 1;    /*!< bit:      4  DFLL Ready                         */
            uint32_t DFLLOOB : 1;    /*!< bit:      5  DFLL Out Of Bounds                 */
            uint32_t DFLLLCKF : 1;   /*!< bit:      6  DFLL Lock Fine                     */
            uint32_t DFLLLCKC : 1;   /*!< bit:      7  DFLL Lock Coarse                   */
            uint32_t DFLLRCS : 1;    /*!< bit:      8  DFLL Reference Clock Stopped       */
            uint32_t BOD33RDY : 1;   /*!< bit:      9  BOD33 Ready                        */
            uint32_t BOD33DET : 1;   /*!< bit:     10  BOD33 Detection                    */
            uint32_t B33SRDY : 1;    /*!< bit:     11  BOD33 Synchronization Ready        */
            uint32_t BOD12RDY : 1;   /*!< bit:     12  BOD12 Ready                        */
            uint32_t BOD12DET : 1;   /*!< bit:     13  BOD12 Detection                    */
            uint32_t B12SRDY : 1;    /*!< bit:     14  BOD12 Synchronization Ready        */
            uint32_t : 17;           /*!< bit: 15..31  Reserved                           */
        } bit;                       /*!< Structure used for bit  access                  */
        uint32_t reg;                /*!< Type      used for register access              */
    } SYSCTRL_INTENSET_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SYSCTRL_INTENSET_OFFSET            0x04        /**< \brief (SYSCTRL_INTENSET offset) Interrupt Enable Set Register */
#define SYSCTRL_INTENSET_RESETVALUE        0x00000000  /**< \brief (SYSCTRL_INTENSET reset_value) Interrupt Enable Set Register */

#define SYSCTRL_INTENSET_XOSCRDY_Pos       0           /**< \brief (SYSCTRL_INTENSET) XOSC Ready */
#define SYSCTRL_INTENSET_XOSCRDY           ( 0x1u << SYSCTRL_INTENSET_XOSCRDY_Pos )
#define SYSCTRL_INTENSET_XOSC32KRDY_Pos    1           /**< \brief (SYSCTRL_INTENSET) XOSC32K Ready */
#define SYSCTRL_INTENSET_XOSC32KRDY        ( 0x1u << SYSCTRL_INTENSET_XOSC32KRDY_Pos )
#define SYSCTRL_INTENSET_OSC32KRDY_Pos     2           /**< \brief (SYSCTRL_INTENSET) OSC32K Ready */
#define SYSCTRL_INTENSET_OSC32KRDY         ( 0x1u << SYSCTRL_INTENSET_OSC32KRDY_Pos )
#define SYSCTRL_INTENSET_OSC8MRDY_Pos      3           /**< \brief (SYSCTRL_INTENSET) OSC8M Ready */
#define SYSCTRL_INTENSET_OSC8MRDY          ( 0x1u << SYSCTRL_INTENSET_OSC8MRDY_Pos )
#define SYSCTRL_INTENSET_DFLLRDY_Pos       4           /**< \brief (SYSCTRL_INTENSET) DFLL Ready */
#define SYSCTRL_INTENSET_DFLLRDY           ( 0x1u << SYSCTRL_INTENSET_DFLLRDY_Pos )
#define SYSCTRL_INTENSET_DFLLOOB_Pos       5           /**< \brief (SYSCTRL_INTENSET) DFLL Out Of Bounds */
#define SYSCTRL_INTENSET_DFLLOOB           ( 0x1u << SYSCTRL_INTENSET_DFLLOOB_Pos )
#define SYSCTRL_INTENSET_DFLLLCKF_Pos      6           /**< \brief (SYSCTRL_INTENSET) DFLL Lock Fine */
#define SYSCTRL_INTENSET_DFLLLCKF          ( 0x1u << SYSCTRL_INTENSET_DFLLLCKF_Pos )
#define SYSCTRL_INTENSET_DFLLLCKC_Pos      7           /**< \brief (SYSCTRL_INTENSET) DFLL Lock Coarse */
#define SYSCTRL_INTENSET_DFLLLCKC          ( 0x1u << SYSCTRL_INTENSET_DFLLLCKC_Pos )
#define SYSCTRL_INTENSET_DFLLRCS_Pos       8           /**< \brief (SYSCTRL_INTENSET) DFLL Reference Clock Stopped */
#define SYSCTRL_INTENSET_DFLLRCS           ( 0x1u << SYSCTRL_INTENSET_DFLLRCS_Pos )
#define SYSCTRL_INTENSET_BOD33RDY_Pos      9           /**< \brief (SYSCTRL_INTENSET) BOD33 Ready */
#define SYSCTRL_INTENSET_BOD33RDY          ( 0x1u << SYSCTRL_INTENSET_BOD33RDY_Pos )
#define SYSCTRL_INTENSET_BOD33DET_Pos      10          /**< \brief (SYSCTRL_INTENSET) BOD33 Detection */
#define SYSCTRL_INTENSET_BOD33DET          ( 0x1u << SYSCTRL_INTENSET_BOD33DET_Pos )
#define SYSCTRL_INTENSET_B33SRDY_Pos       11          /**< \brief (SYSCTRL_INTENSET) BOD33 Synchronization Ready */
#define SYSCTRL_INTENSET_B33SRDY           ( 0x1u << SYSCTRL_INTENSET_B33SRDY_Pos )
#define SYSCTRL_INTENSET_BOD12RDY_Pos      12          /**< \brief (SYSCTRL_INTENSET) BOD12 Ready */
#define SYSCTRL_INTENSET_BOD12RDY          ( 0x1u << SYSCTRL_INTENSET_BOD12RDY_Pos )
#define SYSCTRL_INTENSET_BOD12DET_Pos      13          /**< \brief (SYSCTRL_INTENSET) BOD12 Detection */
#define SYSCTRL_INTENSET_BOD12DET          ( 0x1u << SYSCTRL_INTENSET_BOD12DET_Pos )
#define SYSCTRL_INTENSET_B12SRDY_Pos       14          /**< \brief (SYSCTRL_INTENSET) BOD12 Synchronization Ready */
#define SYSCTRL_INTENSET_B12SRDY           ( 0x1u << SYSCTRL_INTENSET_B12SRDY_Pos )
#define SYSCTRL_INTENSET_MASK              0x00007FFFu /**< \brief (SYSCTRL_INTENSET) MASK Register */

/* -------- SYSCTRL_INTFLAG : (SYSCTRL Offset: 0x08) (R/W 32) Interrupt Flag Status and Clear Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t XOSCRDY : 1;    /*!< bit:      0  XOSC Ready                         */
            uint32_t XOSC32KRDY : 1; /*!< bit:      1  XOSC32K Ready                      */
            uint32_t OSC32KRDY : 1;  /*!< bit:      2  OSC32K Ready                       */
            uint32_t OSC8MRDY : 1;   /*!< bit:      3  OSC8M Ready                        */
            uint32_t DFLLRDY : 1;    /*!< bit:      4  DFLL Ready                         */
            uint32_t DFLLOOB : 1;    /*!< bit:      5  DFLL Out Of Bounds                 */
            uint32_t DFLLLCKF : 1;   /*!< bit:      6  DFLL Lock Fine                     */
            uint32_t DFLLLCKC : 1;   /*!< bit:      7  DFLL Lock Coarse                   */
            uint32_t DFLLRCS : 1;    /*!< bit:      8  DFLL Reference Clock Stopped       */
            uint32_t BOD33RDY : 1;   /*!< bit:      9  BOD33 Ready                        */
            uint32_t BOD33DET : 1;   /*!< bit:     10  BOD33 Detection                    */
            uint32_t B33SRDY : 1;    /*!< bit:     11  BOD33 Synchronization Ready        */
            uint32_t BOD12RDY : 1;   /*!< bit:     12  BOD12 Ready                        */
            uint32_t BOD12DET : 1;   /*!< bit:     13  BOD12 Detection                    */
            uint32_t B12SRDY : 1;    /*!< bit:     14  BOD12 Synchronization Ready        */
            uint32_t : 17;           /*!< bit: 15..31  Reserved                           */
        } bit;                       /*!< Structure used for bit  access                  */
        uint32_t reg;                /*!< Type      used for register access              */
    } SYSCTRL_INTFLAG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SYSCTRL_INTFLAG_OFFSET            0x08        /**< \brief (SYSCTRL_INTFLAG offset) Interrupt Flag Status and Clear Register */
#define SYSCTRL_INTFLAG_RESETVALUE        0x00000000  /**< \brief (SYSCTRL_INTFLAG reset_value) Interrupt Flag Status and Clear Register */

#define SYSCTRL_INTFLAG_XOSCRDY_Pos       0           /**< \brief (SYSCTRL_INTFLAG) XOSC Ready */
#define SYSCTRL_INTFLAG_XOSCRDY           ( 0x1u << SYSCTRL_INTFLAG_XOSCRDY_Pos )
#define SYSCTRL_INTFLAG_XOSC32KRDY_Pos    1           /**< \brief (SYSCTRL_INTFLAG) XOSC32K Ready */
#define SYSCTRL_INTFLAG_XOSC32KRDY        ( 0x1u << SYSCTRL_INTFLAG_XOSC32KRDY_Pos )
#define SYSCTRL_INTFLAG_OSC32KRDY_Pos     2           /**< \brief (SYSCTRL_INTFLAG) OSC32K Ready */
#define SYSCTRL_INTFLAG_OSC32KRDY         ( 0x1u << SYSCTRL_INTFLAG_OSC32KRDY_Pos )
#define SYSCTRL_INTFLAG_OSC8MRDY_Pos      3           /**< \brief (SYSCTRL_INTFLAG) OSC8M Ready */
#define SYSCTRL_INTFLAG_OSC8MRDY          ( 0x1u << SYSCTRL_INTFLAG_OSC8MRDY_Pos )
#define SYSCTRL_INTFLAG_DFLLRDY_Pos       4           /**< \brief (SYSCTRL_INTFLAG) DFLL Ready */
#define SYSCTRL_INTFLAG_DFLLRDY           ( 0x1u << SYSCTRL_INTFLAG_DFLLRDY_Pos )
#define SYSCTRL_INTFLAG_DFLLOOB_Pos       5           /**< \brief (SYSCTRL_INTFLAG) DFLL Out Of Bounds */
#define SYSCTRL_INTFLAG_DFLLOOB           ( 0x1u << SYSCTRL_INTFLAG_DFLLOOB_Pos )
#define SYSCTRL_INTFLAG_DFLLLCKF_Pos      6           /**< \brief (SYSCTRL_INTFLAG) DFLL Lock Fine */
#define SYSCTRL_INTFLAG_DFLLLCKF          ( 0x1u << SYSCTRL_INTFLAG_DFLLLCKF_Pos )
#define SYSCTRL_INTFLAG_DFLLLCKC_Pos      7           /**< \brief (SYSCTRL_INTFLAG) DFLL Lock Coarse */
#define SYSCTRL_INTFLAG_DFLLLCKC          ( 0x1u << SYSCTRL_INTFLAG_DFLLLCKC_Pos )
#define SYSCTRL_INTFLAG_DFLLRCS_Pos       8           /**< \brief (SYSCTRL_INTFLAG) DFLL Reference Clock Stopped */
#define SYSCTRL_INTFLAG_DFLLRCS           ( 0x1u << SYSCTRL_INTFLAG_DFLLRCS_Pos )
#define SYSCTRL_INTFLAG_BOD33RDY_Pos      9           /**< \brief (SYSCTRL_INTFLAG) BOD33 Ready */
#define SYSCTRL_INTFLAG_BOD33RDY          ( 0x1u << SYSCTRL_INTFLAG_BOD33RDY_Pos )
#define SYSCTRL_INTFLAG_BOD33DET_Pos      10          /**< \brief (SYSCTRL_INTFLAG) BOD33 Detection */
#define SYSCTRL_INTFLAG_BOD33DET          ( 0x1u << SYSCTRL_INTFLAG_BOD33DET_Pos )
#define SYSCTRL_INTFLAG_B33SRDY_Pos       11          /**< \brief (SYSCTRL_INTFLAG) BOD33 Synchronization Ready */
#define SYSCTRL_INTFLAG_B33SRDY           ( 0x1u << SYSCTRL_INTFLAG_B33SRDY_Pos )
#define SYSCTRL_INTFLAG_BOD12RDY_Pos      12          /**< \brief (SYSCTRL_INTFLAG) BOD12 Ready */
#define SYSCTRL_INTFLAG_BOD12RDY          ( 0x1u << SYSCTRL_INTFLAG_BOD12RDY_Pos )
#define SYSCTRL_INTFLAG_BOD12DET_Pos      13          /**< \brief (SYSCTRL_INTFLAG) BOD12 Detection */
#define SYSCTRL_INTFLAG_BOD12DET          ( 0x1u << SYSCTRL_INTFLAG_BOD12DET_Pos )
#define SYSCTRL_INTFLAG_B12SRDY_Pos       14          /**< \brief (SYSCTRL_INTFLAG) BOD12 Synchronization Ready */
#define SYSCTRL_INTFLAG_B12SRDY           ( 0x1u << SYSCTRL_INTFLAG_B12SRDY_Pos )
#define SYSCTRL_INTFLAG_MASK              0x00007FFFu /**< \brief (SYSCTRL_INTFLAG) MASK Register */

/* -------- SYSCTRL_PCLKSR : (SYSCTRL Offset: 0x0C) (R/  32) Power and Clocks Status Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t XOSCRDY : 1;    /*!< bit:      0  XOSC Ready                         */
            uint32_t XOSC32KRDY : 1; /*!< bit:      1  XOSC32K Ready                      */
            uint32_t OSC32KRDY : 1;  /*!< bit:      2  OSC32K Ready                       */
            uint32_t OSC8MRDY : 1;   /*!< bit:      3  OSC8M Ready                        */
            uint32_t DFLLRDY : 1;    /*!< bit:      4  DFLL Ready                         */
            uint32_t DFLLOOB : 1;    /*!< bit:      5  DFLL Out Of Bounds                 */
            uint32_t DFLLLCKF : 1;   /*!< bit:      6  DFLL Lock Fine                     */
            uint32_t DFLLLCKC : 1;   /*!< bit:      7  DFLL Lock Coarse                   */
            uint32_t DFLLRCS : 1;    /*!< bit:      8  DFLL Reference Clock Stopped       */
            uint32_t BOD33RDY : 1;   /*!< bit:      9  BOD33 Ready                        */
            uint32_t BOD33DET : 1;   /*!< bit:     10  BOD33 Detection                    */
            uint32_t B33SRDY : 1;    /*!< bit:     11  BOD33 Synchronization Ready        */
            uint32_t BOD12RDY : 1;   /*!< bit:     12  BOD12 Ready                        */
            uint32_t BOD12DET : 1;   /*!< bit:     13  BOD12 Detection                    */
            uint32_t B12SRDY : 1;    /*!< bit:     14  BOD12 Synchronization Ready        */
            uint32_t : 17;           /*!< bit: 15..31  Reserved                           */
        } bit;                       /*!< Structure used for bit  access                  */
        uint32_t reg;                /*!< Type      used for register access              */
    } SYSCTRL_PCLKSR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SYSCTRL_PCLKSR_OFFSET            0x0C        /**< \brief (SYSCTRL_PCLKSR offset) Power and Clocks Status Register */
#define SYSCTRL_PCLKSR_RESETVALUE        0x00000000  /**< \brief (SYSCTRL_PCLKSR reset_value) Power and Clocks Status Register */

#define SYSCTRL_PCLKSR_XOSCRDY_Pos       0           /**< \brief (SYSCTRL_PCLKSR) XOSC Ready */
#define SYSCTRL_PCLKSR_XOSCRDY           ( 0x1u << SYSCTRL_PCLKSR_XOSCRDY_Pos )
#define SYSCTRL_PCLKSR_XOSC32KRDY_Pos    1           /**< \brief (SYSCTRL_PCLKSR) XOSC32K Ready */
#define SYSCTRL_PCLKSR_XOSC32KRDY        ( 0x1u << SYSCTRL_PCLKSR_XOSC32KRDY_Pos )
#define SYSCTRL_PCLKSR_OSC32KRDY_Pos     2           /**< \brief (SYSCTRL_PCLKSR) OSC32K Ready */
#define SYSCTRL_PCLKSR_OSC32KRDY         ( 0x1u << SYSCTRL_PCLKSR_OSC32KRDY_Pos )
#define SYSCTRL_PCLKSR_OSC8MRDY_Pos      3           /**< \brief (SYSCTRL_PCLKSR) OSC8M Ready */
#define SYSCTRL_PCLKSR_OSC8MRDY          ( 0x1u << SYSCTRL_PCLKSR_OSC8MRDY_Pos )
#define SYSCTRL_PCLKSR_DFLLRDY_Pos       4           /**< \brief (SYSCTRL_PCLKSR) DFLL Ready */
#define SYSCTRL_PCLKSR_DFLLRDY           ( 0x1u << SYSCTRL_PCLKSR_DFLLRDY_Pos )
#define SYSCTRL_PCLKSR_DFLLOOB_Pos       5           /**< \brief (SYSCTRL_PCLKSR) DFLL Out Of Bounds */
#define SYSCTRL_PCLKSR_DFLLOOB           ( 0x1u << SYSCTRL_PCLKSR_DFLLOOB_Pos )
#define SYSCTRL_PCLKSR_DFLLLCKF_Pos      6           /**< \brief (SYSCTRL_PCLKSR) DFLL Lock Fine */
#define SYSCTRL_PCLKSR_DFLLLCKF          ( 0x1u << SYSCTRL_PCLKSR_DFLLLCKF_Pos )
#define SYSCTRL_PCLKSR_DFLLLCKC_Pos      7           /**< \brief (SYSCTRL_PCLKSR) DFLL Lock Coarse */
#define SYSCTRL_PCLKSR_DFLLLCKC          ( 0x1u << SYSCTRL_PCLKSR_DFLLLCKC_Pos )
#define SYSCTRL_PCLKSR_DFLLRCS_Pos       8           /**< \brief (SYSCTRL_PCLKSR) DFLL Reference Clock Stopped */
#define SYSCTRL_PCLKSR_DFLLRCS           ( 0x1u << SYSCTRL_PCLKSR_DFLLRCS_Pos )
#define SYSCTRL_PCLKSR_BOD33RDY_Pos      9           /**< \brief (SYSCTRL_PCLKSR) BOD33 Ready */
#define SYSCTRL_PCLKSR_BOD33RDY          ( 0x1u << SYSCTRL_PCLKSR_BOD33RDY_Pos )
#define SYSCTRL_PCLKSR_BOD33DET_Pos      10          /**< \brief (SYSCTRL_PCLKSR) BOD33 Detection */
#define SYSCTRL_PCLKSR_BOD33DET          ( 0x1u << SYSCTRL_PCLKSR_BOD33DET_Pos )
#define SYSCTRL_PCLKSR_B33SRDY_Pos       11          /**< \brief (SYSCTRL_PCLKSR) BOD33 Synchronization Ready */
#define SYSCTRL_PCLKSR_B33SRDY           ( 0x1u << SYSCTRL_PCLKSR_B33SRDY_Pos )
#define SYSCTRL_PCLKSR_BOD12RDY_Pos      12          /**< \brief (SYSCTRL_PCLKSR) BOD12 Ready */
#define SYSCTRL_PCLKSR_BOD12RDY          ( 0x1u << SYSCTRL_PCLKSR_BOD12RDY_Pos )
#define SYSCTRL_PCLKSR_BOD12DET_Pos      13          /**< \brief (SYSCTRL_PCLKSR) BOD12 Detection */
#define SYSCTRL_PCLKSR_BOD12DET          ( 0x1u << SYSCTRL_PCLKSR_BOD12DET_Pos )
#define SYSCTRL_PCLKSR_B12SRDY_Pos       14          /**< \brief (SYSCTRL_PCLKSR) BOD12 Synchronization Ready */
#define SYSCTRL_PCLKSR_B12SRDY           ( 0x1u << SYSCTRL_PCLKSR_B12SRDY_Pos )
#define SYSCTRL_PCLKSR_MASK              0x00007FFFu /**< \brief (SYSCTRL_PCLKSR) MASK Register */

