FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_sysctrl.h
/* -------- SYSCTRL_XOSC : (SYSCTRL Offset: 0x10) (R/W 16) XOSC Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t : 1;          /*!< bit:      0  Reserved                           */
            uint16_t ENABLE : 1;   /*!< bit:      1  Enable                             */
            uint16_t XTALEN : 1;   /*!< bit:      2  Crystal Oscillator Enable          */
            uint16_t : 3;          /*!< bit:  3.. 5  Reserved                           */
            uint16_t RUNSTDBY : 1; /*!< bit:      6  Run during Standby                 */
            uint16_t ONDEMAND : 1; /*!< bit:      7  Enable on Demand                   */
            uint16_t GAIN : 3;     /*!< bit:  8..10  Gain Value                         */
            uint16_t AMPGC : 1;    /*!< bit:     11  Automatic Amplitude Gain Control   */
            uint16_t STARTUP : 4;  /*!< bit: 12..15  Start-Up Time                      */
        } bit;                     /*!< Structure used for bit  access                  */
        uint16_t reg;              /*!< Type      used for register access              */
    } SYSCTRL_XOSC_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SYSCTRL_XOSC_OFFSET          0x10        /**< \brief (SYSCTRL_XOSC offset) XOSC Control Register */
#define SYSCTRL_XOSC_RESETVALUE      0x0080      /**< \brief (SYSCTRL_XOSC reset_value) XOSC Control Register */

#define SYSCTRL_XOSC_ENABLE_Pos      1           /**< \brief (SYSCTRL_XOSC) Enable */
#define SYSCTRL_XOSC_ENABLE          ( 0x1u << SYSCTRL_XOSC_ENABLE_Pos )
#define SYSCTRL_XOSC_XTALEN_Pos      2           /**< \brief (SYSCTRL_XOSC) Crystal Oscillator Enable */
#define SYSCTRL_XOSC_XTALEN          ( 0x1u << SYSCTRL_XOSC_XTALEN_Pos )
#define SYSCTRL_XOSC_RUNSTDBY_Pos    6           /**< \brief (SYSCTRL_XOSC) Run during Standby */
#define SYSCTRL_XOSC_RUNSTDBY        ( 0x1u << SYSCTRL_XOSC_RUNSTDBY_Pos )
#define SYSCTRL_XOSC_ONDEMAND_Pos    7           /**< \brief (SYSCTRL_XOSC) Enable on Demand */
#define SYSCTRL_XOSC_ONDEMAND        ( 0x1u << SYSCTRL_XOSC_ONDEMAND_Pos )
#define SYSCTRL_XOSC_GAIN_Pos        8           /**< \brief (SYSCTRL_XOSC) Gain Value */
#define SYSCTRL_XOSC_GAIN_Msk        ( 0x7u << SYSCTRL_XOSC_GAIN_Pos )
#define SYSCTRL_XOSC_GAIN( value )    ( ( SYSCTRL_XOSC_GAIN_Msk & ( ( value ) << SYSCTRL_XOSC_GAIN_Pos ) ) )
#define SYSCTRL_XOSC_AMPGC_Pos       11          /**< \brief (SYSCTRL_XOSC) Automatic Amplitude Gain Control */
#define SYSCTRL_XOSC_AMPGC           ( 0x1u << SYSCTRL_XOSC_AMPGC_Pos )
#define SYSCTRL_XOSC_STARTUP_Pos     12          /**< \brief (SYSCTRL_XOSC) Start-Up Time */
#define SYSCTRL_XOSC_STARTUP_Msk     ( 0xFu << SYSCTRL_XOSC_STARTUP_Pos )
#define SYSCTRL_XOSC_STARTUP( value )    ( ( SYSCTRL_XOSC_STARTUP_Msk & ( ( value ) << SYSCTRL_XOSC_STARTUP_Pos ) ) )
#define SYSCTRL_XOSC_MASK            0xFFC6u     /**< \brief (SYSCTRL_XOSC) MASK Register */

/* -------- SYSCTRL_XOSC32K : (SYSCTRL Offset: 0x14) (R/W 16) XOSC32K Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t : 1;          /*!< bit:      0  Reserved                           */
            uint16_t ENABLE : 1;   /*!< bit:      1  Enable                             */
            uint16_t XTALEN : 1;   /*!< bit:      2  Crystal Oscillator Enable          */
            uint16_t EN32K : 1;    /*!< bit:      3  32kHz Output Enable                */
            uint16_t EN1K : 1;     /*!< bit:      4  1kHz Output Enable                 */
            uint16_t AAMPEN : 1;   /*!< bit:      5  Automatic Amplitude Control Enable */
            uint16_t RUNSTDBY : 1; /*!< bit:      6  Run during Standby                 */
            uint16_t ONDEMAND : 1; /*!< bit:      7  Enable on Demand                   */
            uint16_t STARTUP : 3;  /*!< bit:  8..10  Start-Up Time                      */
            uint16_t : 1;          /*!< bit:     11  Reserved                           */
            uint16_t WRTLOCK : 1;  /*!< bit:     12  Write Lock                         */
            uint16_t : 3;          /*!< bit: 13..15  Reserved                           */
        } bit;                     /*!< Structure used for bit  access                  */
        uint16_t reg;              /*!< Type      used for register access              */
    } SYSCTRL_XOSC32K_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SYSCTRL_XOSC32K_OFFSET          0x14     /**< \brief (SYSCTRL_XOSC32K offset) XOSC32K Control Register */
#define SYSCTRL_XOSC32K_RESETVALUE      0x0080   /**< \brief (SYSCTRL_XOSC32K reset_value) XOSC32K Control Register */

#define SYSCTRL_XOSC32K_ENABLE_Pos      1        /**< \brief (SYSCTRL_XOSC32K) Enable */
#define SYSCTRL_XOSC32K_ENABLE          ( 0x1u << SYSCTRL_XOSC32K_ENABLE_Pos )
#define SYSCTRL_XOSC32K_XTALEN_Pos      2        /**< \brief (SYSCTRL_XOSC32K) Crystal Oscillator Enable */
#define SYSCTRL_XOSC32K_XTALEN          ( 0x1u << SYSCTRL_XOSC32K_XTALEN_Pos )
#define SYSCTRL_XOSC32K_EN32K_Pos       3        /**< \brief (SYSCTRL_XOSC32K) 32kHz Output Enable */
#define SYSCTRL_XOSC32K_EN32K           ( 0x1u << SYSCTRL_XOSC32K_EN32K_Pos )
#define SYSCTRL_XOSC32K_EN1K_Pos        4        /**< \brief (SYSCTRL_XOSC32K) 1kHz Output Enable */
#define SYSCTRL_XOSC32K_EN1K            ( 0x1u << SYSCTRL_XOSC32K_EN1K_Pos )
#define SYSCTRL_XOSC32K_AAMPEN_Pos      5        /**< \brief (SYSCTRL_XOSC32K) Automatic Amplitude Control Enable */
#define SYSCTRL_XOSC32K_AAMPEN          ( 0x1u << SYSCTRL_XOSC32K_AAMPEN_Pos )
#define SYSCTRL_XOSC32K_RUNSTDBY_Pos    6        /**< \brief (SYSCTRL_XOSC32K) Run during Standby */
#define SYSCTRL_XOSC32K_RUNSTDBY        ( 0x1u << SYSCTRL_XOSC32K_RUNSTDBY_Pos )
#define SYSCTRL_XOSC32K_ONDEMAND_Pos    7        /**< \brief (SYSCTRL_XOSC32K) Enable on Demand */
#define SYSCTRL_XOSC32K_ONDEMAND        ( 0x1u << SYSCTRL_XOSC32K_ONDEMAND_Pos )
#define SYSCTRL_XOSC32K_STARTUP_Pos     8        /**< \brief (SYSCTRL_XOSC32K) Start-Up Time */
#define SYSCTRL_XOSC32K_STARTUP_Msk     ( 0x7u << SYSCTRL_XOSC32K_STARTUP_Pos )
#define SYSCTRL_XOSC32K_STARTUP( value )    ( ( SYSCTRL_XOSC32K_STARTUP_Msk & ( ( value ) << SYSCTRL_XOSC32K_STARTUP_Pos ) ) )
#define SYSCTRL_XOSC32K_WRTLOCK_Pos     12       /**< \brief (SYSCTRL_XOSC32K) Write Lock */
#define SYSCTRL_XOSC32K_WRTLOCK         ( 0x1u << SYSCTRL_XOSC32K_WRTLOCK_Pos )
#define SYSCTRL_XOSC32K_MASK            0x17FEu  /**< \brief (SYSCTRL_XOSC32K) MASK Register */

/* -------- SYSCTRL_OSC32K : (SYSCTRL Offset: 0x18) (R/W 32) OSC32K Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t : 1;          /*!< bit:      0  Reserved                           */
            uint32_t ENABLE : 1;   /*!< bit:      1  Enable                             */
            uint32_t EN32K : 1;    /*!< bit:      2  32kHz Output Enable                */
            uint32_t EN1K : 1;     /*!< bit:      3  1kHz Output Enable                 */
            uint32_t : 2;          /*!< bit:  4.. 5  Reserved                           */
            uint32_t RUNSTDBY : 1; /*!< bit:      6  Run during Standby                 */
            uint32_t ONDEMAND : 1; /*!< bit:      7  Enable on Demand                   */
            uint32_t STARTUP : 3;  /*!< bit:  8..10  Start-Up Time                      */
            uint32_t : 1;          /*!< bit:     11  Reserved                           */
            uint32_t WRTLOCK : 1;  /*!< bit:     12  Write Lock                         */
            uint32_t : 3;          /*!< bit: 13..15  Reserved                           */
            uint32_t CALIB : 7;    /*!< bit: 16..22  Calibration Value                  */
            uint32_t : 9;          /*!< bit: 23..31  Reserved                           */
        } bit;                     /*!< Structure used for bit  access                  */
        uint32_t reg;              /*!< Type      used for register access              */
    } SYSCTRL_OSC32K_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

