FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_sysctrl.h
#define SYSCTRL_OSC32K_OFFSET          0x18       /**< \brief (SYSCTRL_OSC32K offset) OSC32K Control Register */
#define SYSCTRL_OSC32K_RESETVALUE      0x003F0080 /**< \brief (SYSCTRL_OSC32K reset_value) OSC32K Control Register */

#define SYSCTRL_OSC32K_ENABLE_Pos      1          /**< \brief (SYSCTRL_OSC32K) Enable */
#define SYSCTRL_OSC32K_ENABLE          ( 0x1u << SYSCTRL_OSC32K_ENABLE_Pos )
#define SYSCTRL_OSC32K_EN32K_Pos       2          /**< \brief (SYSCTRL_OSC32K) 32kHz Output Enable */
#define SYSCTRL_OSC32K_EN32K           ( 0x1u << SYSCTRL_OSC32K_EN32K_Pos )
#define SYSCTRL_OSC32K_EN1K_Pos        3          /**< \brief (SYSCTRL_OSC32K) 1kHz Output Enable */
#define SYSCTRL_OSC32K_EN1K            ( 0x1u << SYSCTRL_OSC32K_EN1K_Pos )
#define SYSCTRL_OSC32K_RUNSTDBY_Pos    6          /**< \brief (SYSCTRL_OSC32K) Run during Standby */
#define SYSCTRL_OSC32K_RUNSTDBY        ( 0x1u << SYSCTRL_OSC32K_RUNSTDBY_Pos )
#define SYSCTRL_OSC32K_ONDEMAND_Pos    7          /**< \brief (SYSCTRL_OSC32K) Enable on Demand */
#define SYSCTRL_OSC32K_ONDEMAND        ( 0x1u << SYSCTRL_OSC32K_ONDEMAND_Pos )
#define SYSCTRL_OSC32K_STARTUP_Pos     8          /**< \brief (SYSCTRL_OSC32K) Start-Up Time */
#define SYSCTRL_OSC32K_STARTUP_Msk     ( 0x7u << SYSCTRL_OSC32K_STARTUP_Pos )
#define SYSCTRL_OSC32K_STARTUP( value )    ( ( SYSCTRL_OSC32K_STARTUP_Msk & ( ( value ) << SYSCTRL_OSC32K_STARTUP_Pos ) ) )
#define SYSCTRL_OSC32K_WRTLOCK_Pos     12        /**< \brief (SYSCTRL_OSC32K) Write Lock */
#define SYSCTRL_OSC32K_WRTLOCK         ( 0x1u << SYSCTRL_OSC32K_WRTLOCK_Pos )
#define SYSCTRL_OSC32K_CALIB_Pos       16        /**< \brief (SYSCTRL_OSC32K) Calibration Value */
#define SYSCTRL_OSC32K_CALIB_Msk       ( 0x7Fu << SYSCTRL_OSC32K_CALIB_Pos )
#define SYSCTRL_OSC32K_CALIB( value )    ( ( SYSCTRL_OSC32K_CALIB_Msk & ( ( value ) << SYSCTRL_OSC32K_CALIB_Pos ) ) )
#define SYSCTRL_OSC32K_MASK            0x007F17CEu /**< \brief (SYSCTRL_OSC32K) MASK Register */

/* -------- SYSCTRL_OSCULP32K : (SYSCTRL Offset: 0x1C) (R/W  8) OSCULP32K Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t CALIB : 5;   /*!< bit:  0.. 4  Calibration Value                  */
            uint8_t  : 2;        /*!< bit:  5.. 6  Reserved                           */
            uint8_t WRTLOCK : 1; /*!< bit:      7  Write Lock                         */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } SYSCTRL_OSCULP32K_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SYSCTRL_OSCULP32K_OFFSET         0x1C    /**< \brief (SYSCTRL_OSCULP32K offset) OSCULP32K Control Register */
#define SYSCTRL_OSCULP32K_RESETVALUE     0x0F    /**< \brief (SYSCTRL_OSCULP32K reset_value) OSCULP32K Control Register */

#define SYSCTRL_OSCULP32K_CALIB_Pos      0       /**< \brief (SYSCTRL_OSCULP32K) Calibration Value */
#define SYSCTRL_OSCULP32K_CALIB_Msk      ( 0x1Fu << SYSCTRL_OSCULP32K_CALIB_Pos )
#define SYSCTRL_OSCULP32K_CALIB( value )    ( ( SYSCTRL_OSCULP32K_CALIB_Msk & ( ( value ) << SYSCTRL_OSCULP32K_CALIB_Pos ) ) )
#define SYSCTRL_OSCULP32K_WRTLOCK_Pos    7       /**< \brief (SYSCTRL_OSCULP32K) Write Lock */
#define SYSCTRL_OSCULP32K_WRTLOCK        ( 0x1u << SYSCTRL_OSCULP32K_WRTLOCK_Pos )
#define SYSCTRL_OSCULP32K_MASK           0x9Fu   /**< \brief (SYSCTRL_OSCULP32K) MASK Register */

/* -------- SYSCTRL_OSC8M : (SYSCTRL Offset: 0x20) (R/W 32) OSC8M Control Register A -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t : 1;          /*!< bit:      0  Reserved                           */
            uint32_t ENABLE : 1;   /*!< bit:      1  Enable                             */
            uint32_t : 4;          /*!< bit:  2.. 5  Reserved                           */
            uint32_t RUNSTDBY : 1; /*!< bit:      6  Run during Standby                 */
            uint32_t ONDEMAND : 1; /*!< bit:      7  Enable on Demand                   */
            uint32_t PRESC : 2;    /*!< bit:  8.. 9  Prescaler Select                   */
            uint32_t : 6;          /*!< bit: 10..15  Reserved                           */
            uint32_t CALIB : 12;   /*!< bit: 16..27  Calibration Value                  */
            uint32_t : 2;          /*!< bit: 28..29  Reserved                           */
            uint32_t FRANGE : 2;   /*!< bit: 30..31  Frequency Range                    */
        } bit;                     /*!< Structure used for bit  access                  */
        uint32_t reg;              /*!< Type      used for register access              */
    } SYSCTRL_OSC8M_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SYSCTRL_OSC8M_OFFSET          0x20       /**< \brief (SYSCTRL_OSC8M offset) OSC8M Control Register A */
#define SYSCTRL_OSC8M_RESETVALUE      0x00000080 /**< \brief (SYSCTRL_OSC8M reset_value) OSC8M Control Register A */

#define SYSCTRL_OSC8M_ENABLE_Pos      1          /**< \brief (SYSCTRL_OSC8M) Enable */
#define SYSCTRL_OSC8M_ENABLE          ( 0x1u << SYSCTRL_OSC8M_ENABLE_Pos )
#define SYSCTRL_OSC8M_RUNSTDBY_Pos    6          /**< \brief (SYSCTRL_OSC8M) Run during Standby */
#define SYSCTRL_OSC8M_RUNSTDBY        ( 0x1u << SYSCTRL_OSC8M_RUNSTDBY_Pos )
#define SYSCTRL_OSC8M_ONDEMAND_Pos    7          /**< \brief (SYSCTRL_OSC8M) Enable on Demand */
#define SYSCTRL_OSC8M_ONDEMAND        ( 0x1u << SYSCTRL_OSC8M_ONDEMAND_Pos )
#define SYSCTRL_OSC8M_PRESC_Pos       8          /**< \brief (SYSCTRL_OSC8M) Prescaler Select */
#define SYSCTRL_OSC8M_PRESC_Msk       ( 0x3u << SYSCTRL_OSC8M_PRESC_Pos )
#define SYSCTRL_OSC8M_PRESC( value )     ( ( SYSCTRL_OSC8M_PRESC_Msk & ( ( value ) << SYSCTRL_OSC8M_PRESC_Pos ) ) )
#define SYSCTRL_OSC8M_CALIB_Pos       16         /**< \brief (SYSCTRL_OSC8M) Calibration Value */
#define SYSCTRL_OSC8M_CALIB_Msk       ( 0xFFFu << SYSCTRL_OSC8M_CALIB_Pos )
#define SYSCTRL_OSC8M_CALIB( value )     ( ( SYSCTRL_OSC8M_CALIB_Msk & ( ( value ) << SYSCTRL_OSC8M_CALIB_Pos ) ) )
#define SYSCTRL_OSC8M_FRANGE_Pos      30         /**< \brief (SYSCTRL_OSC8M) Frequency Range */
#define SYSCTRL_OSC8M_FRANGE_Msk      ( 0x3u << SYSCTRL_OSC8M_FRANGE_Pos )
#define SYSCTRL_OSC8M_FRANGE( value )    ( ( SYSCTRL_OSC8M_FRANGE_Msk & ( ( value ) << SYSCTRL_OSC8M_FRANGE_Pos ) ) )
#define SYSCTRL_OSC8M_MASK            0xCFFF03C2u /**< \brief (SYSCTRL_OSC8M) MASK Register */

/* -------- SYSCTRL_DFLLCTRL : (SYSCTRL Offset: 0x24) (R/W 16) DFLL Config Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t : 1;          /*!< bit:      0  Reserved                           */
            uint16_t ENABLE : 1;   /*!< bit:      1  Enable                             */
            uint16_t MODE : 1;     /*!< bit:      2  Mode Selection                     */
            uint16_t STABLE : 1;   /*!< bit:      3  Stable Frequency                   */
            uint16_t LLAW : 1;     /*!< bit:      4  Lose Lock After Wake               */
            uint16_t USBCRM : 1;   /*!< bit:      5  USB Clock Recovery Mode            */
            uint16_t RUNSTDBY : 1; /*!< bit:      6  Run during Standby                 */
            uint16_t ONDEMAND : 1; /*!< bit:      7  Enable on Demand                   */
            uint16_t CCDIS : 1;    /*!< bit:      8  Chill Cycle Disable                */
            uint16_t QLDIS : 1;    /*!< bit:      9  Quick Lock Disable                 */
            uint16_t : 6;          /*!< bit: 10..15  Reserved                           */
        } bit;                     /*!< Structure used for bit  access                  */
        uint16_t reg;              /*!< Type      used for register access              */
    } SYSCTRL_DFLLCTRL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SYSCTRL_DFLLCTRL_OFFSET          0x24    /**< \brief (SYSCTRL_DFLLCTRL offset) DFLL Config Register */
#define SYSCTRL_DFLLCTRL_RESETVALUE      0x0080  /**< \brief (SYSCTRL_DFLLCTRL reset_value) DFLL Config Register */

