FreeRTOS/FreeRTOS/FreeRTOS/Demo/CORTEX_M0+_Atmel_SAMD20_XPlained/RTOSDemo/src/ASF/sam0/utils/cmsis/samd20/include/component/component_sysctrl.h
#define SYSCTRL_DFLLCTRL_ENABLE_Pos      1       /**< \brief (SYSCTRL_DFLLCTRL) Enable */
#define SYSCTRL_DFLLCTRL_ENABLE          ( 0x1u << SYSCTRL_DFLLCTRL_ENABLE_Pos )
#define SYSCTRL_DFLLCTRL_MODE_Pos        2       /**< \brief (SYSCTRL_DFLLCTRL) Mode Selection */
#define SYSCTRL_DFLLCTRL_MODE            ( 0x1u << SYSCTRL_DFLLCTRL_MODE_Pos )
#define SYSCTRL_DFLLCTRL_STABLE_Pos      3       /**< \brief (SYSCTRL_DFLLCTRL) Stable Frequency */
#define SYSCTRL_DFLLCTRL_STABLE          ( 0x1u << SYSCTRL_DFLLCTRL_STABLE_Pos )
#define SYSCTRL_DFLLCTRL_LLAW_Pos        4       /**< \brief (SYSCTRL_DFLLCTRL) Lose Lock After Wake */
#define SYSCTRL_DFLLCTRL_LLAW            ( 0x1u << SYSCTRL_DFLLCTRL_LLAW_Pos )
#define SYSCTRL_DFLLCTRL_USBCRM_Pos      5       /**< \brief (SYSCTRL_DFLLCTRL) USB Clock Recovery Mode */
#define SYSCTRL_DFLLCTRL_USBCRM          ( 0x1u << SYSCTRL_DFLLCTRL_USBCRM_Pos )
#define SYSCTRL_DFLLCTRL_RUNSTDBY_Pos    6       /**< \brief (SYSCTRL_DFLLCTRL) Run during Standby */
#define SYSCTRL_DFLLCTRL_RUNSTDBY        ( 0x1u << SYSCTRL_DFLLCTRL_RUNSTDBY_Pos )
#define SYSCTRL_DFLLCTRL_ONDEMAND_Pos    7       /**< \brief (SYSCTRL_DFLLCTRL) Enable on Demand */
#define SYSCTRL_DFLLCTRL_ONDEMAND        ( 0x1u << SYSCTRL_DFLLCTRL_ONDEMAND_Pos )
#define SYSCTRL_DFLLCTRL_CCDIS_Pos       8       /**< \brief (SYSCTRL_DFLLCTRL) Chill Cycle Disable */
#define SYSCTRL_DFLLCTRL_CCDIS           ( 0x1u << SYSCTRL_DFLLCTRL_CCDIS_Pos )
#define SYSCTRL_DFLLCTRL_QLDIS_Pos       9       /**< \brief (SYSCTRL_DFLLCTRL) Quick Lock Disable */
#define SYSCTRL_DFLLCTRL_QLDIS           ( 0x1u << SYSCTRL_DFLLCTRL_QLDIS_Pos )
#define SYSCTRL_DFLLCTRL_MASK            0x03FEu /**< \brief (SYSCTRL_DFLLCTRL) MASK Register */

/* -------- SYSCTRL_DFLLVAL : (SYSCTRL Offset: 0x28) (R/W 32) DFLL Calibration Value Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t FINE : 8;   /*!< bit:  0.. 7  Fine Calibration Value             */
            uint32_t COARSE : 5; /*!< bit:  8..12  Coarse Calibration Value           */
            uint32_t : 3;        /*!< bit: 13..15  Reserved                           */
            uint32_t DIFF : 16;  /*!< bit: 16..31  Multiplication Ratio Difference    */
        } bit;                   /*!< Structure used for bit  access                  */
        uint32_t reg;            /*!< Type      used for register access              */
    } SYSCTRL_DFLLVAL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SYSCTRL_DFLLVAL_OFFSET        0x28       /**< \brief (SYSCTRL_DFLLVAL offset) DFLL Calibration Value Register */
#define SYSCTRL_DFLLVAL_RESETVALUE    0x00000000 /**< \brief (SYSCTRL_DFLLVAL reset_value) DFLL Calibration Value Register */

#define SYSCTRL_DFLLVAL_FINE_Pos      0          /**< \brief (SYSCTRL_DFLLVAL) Fine Calibration Value */
#define SYSCTRL_DFLLVAL_FINE_Msk      ( 0xFFu << SYSCTRL_DFLLVAL_FINE_Pos )
#define SYSCTRL_DFLLVAL_FINE( value )      ( ( SYSCTRL_DFLLVAL_FINE_Msk & ( ( value ) << SYSCTRL_DFLLVAL_FINE_Pos ) ) )
#define SYSCTRL_DFLLVAL_COARSE_Pos    8          /**< \brief (SYSCTRL_DFLLVAL) Coarse Calibration Value */
#define SYSCTRL_DFLLVAL_COARSE_Msk    ( 0x1Fu << SYSCTRL_DFLLVAL_COARSE_Pos )
#define SYSCTRL_DFLLVAL_COARSE( value )    ( ( SYSCTRL_DFLLVAL_COARSE_Msk & ( ( value ) << SYSCTRL_DFLLVAL_COARSE_Pos ) ) )
#define SYSCTRL_DFLLVAL_DIFF_Pos      16         /**< \brief (SYSCTRL_DFLLVAL) Multiplication Ratio Difference */
#define SYSCTRL_DFLLVAL_DIFF_Msk      ( 0xFFFFu << SYSCTRL_DFLLVAL_DIFF_Pos )
#define SYSCTRL_DFLLVAL_DIFF( value )      ( ( SYSCTRL_DFLLVAL_DIFF_Msk & ( ( value ) << SYSCTRL_DFLLVAL_DIFF_Pos ) ) )
#define SYSCTRL_DFLLVAL_MASK          0xFFFF1FFFu /**< \brief (SYSCTRL_DFLLVAL) MASK Register */

/* -------- SYSCTRL_DFLLMUL : (SYSCTRL Offset: 0x2C) (R/W 32) DFLL Multiplier Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t MUL : 16;  /*!< bit:  0..15  Multiplication Value               */
            uint32_t FSTEP : 8; /*!< bit: 16..23  Maximum Fine Step Size             */
            uint32_t CSTEP : 5; /*!< bit: 24..28  Maximum Coarse Step Size           */
            uint32_t : 3;       /*!< bit: 29..31  Reserved                           */
        } bit;                  /*!< Structure used for bit  access                  */
        uint32_t reg;           /*!< Type      used for register access              */
    } SYSCTRL_DFLLMUL_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SYSCTRL_DFLLMUL_OFFSET        0x2C       /**< \brief (SYSCTRL_DFLLMUL offset) DFLL Multiplier Register */
#define SYSCTRL_DFLLMUL_RESETVALUE    0x00000000 /**< \brief (SYSCTRL_DFLLMUL reset_value) DFLL Multiplier Register */

#define SYSCTRL_DFLLMUL_MUL_Pos       0          /**< \brief (SYSCTRL_DFLLMUL) Multiplication Value */
#define SYSCTRL_DFLLMUL_MUL_Msk       ( 0xFFFFu << SYSCTRL_DFLLMUL_MUL_Pos )
#define SYSCTRL_DFLLMUL_MUL( value )      ( ( SYSCTRL_DFLLMUL_MUL_Msk & ( ( value ) << SYSCTRL_DFLLMUL_MUL_Pos ) ) )
#define SYSCTRL_DFLLMUL_FSTEP_Pos     16         /**< \brief (SYSCTRL_DFLLMUL) Maximum Fine Step Size */
#define SYSCTRL_DFLLMUL_FSTEP_Msk     ( 0xFFu << SYSCTRL_DFLLMUL_FSTEP_Pos )
#define SYSCTRL_DFLLMUL_FSTEP( value )    ( ( SYSCTRL_DFLLMUL_FSTEP_Msk & ( ( value ) << SYSCTRL_DFLLMUL_FSTEP_Pos ) ) )
#define SYSCTRL_DFLLMUL_CSTEP_Pos     24         /**< \brief (SYSCTRL_DFLLMUL) Maximum Coarse Step Size */
#define SYSCTRL_DFLLMUL_CSTEP_Msk     ( 0x1Fu << SYSCTRL_DFLLMUL_CSTEP_Pos )
#define SYSCTRL_DFLLMUL_CSTEP( value )    ( ( SYSCTRL_DFLLMUL_CSTEP_Msk & ( ( value ) << SYSCTRL_DFLLMUL_CSTEP_Pos ) ) )
#define SYSCTRL_DFLLMUL_MASK          0x1FFFFFFFu /**< \brief (SYSCTRL_DFLLMUL) MASK Register */

/* -------- SYSCTRL_DFLLSYNC : (SYSCTRL Offset: 0x30) (R/W  8) DFLL Synchronization Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint8_t  : 7;        /*!< bit:  0.. 6  Reserved                           */
            uint8_t READREQ : 1; /*!< bit:      7  Read Request Synchronization       */
        } bit;                   /*!< Structure used for bit  access                  */
        uint8_t reg;             /*!< Type      used for register access              */
    } SYSCTRL_DFLLSYNC_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SYSCTRL_DFLLSYNC_OFFSET         0x30     /**< \brief (SYSCTRL_DFLLSYNC offset) DFLL Synchronization Register */
#define SYSCTRL_DFLLSYNC_RESETVALUE     0x00     /**< \brief (SYSCTRL_DFLLSYNC reset_value) DFLL Synchronization Register */

#define SYSCTRL_DFLLSYNC_READREQ_Pos    7        /**< \brief (SYSCTRL_DFLLSYNC) Read Request Synchronization */
#define SYSCTRL_DFLLSYNC_READREQ        ( 0x1u << SYSCTRL_DFLLSYNC_READREQ_Pos )
#define SYSCTRL_DFLLSYNC_MASK           0x80u    /**< \brief (SYSCTRL_DFLLSYNC) MASK Register */

/* -------- SYSCTRL_BOD33 : (SYSCTRL Offset: 0x34) (R/W 32) BOD33 Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t : 1;          /*!< bit:      0  Reserved                           */
            uint32_t ENABLE : 1;   /*!< bit:      1  Enable                             */
            uint32_t HYST : 1;     /*!< bit:      2  Hysteresis Enable                  */
            uint32_t ACTION : 2;   /*!< bit:  3.. 4  Action when Threshold Crossed      */
            uint32_t : 1;          /*!< bit:      5  Reserved                           */
            uint32_t RUNSTDBY : 1; /*!< bit:      6  Run during Standby                 */
            uint32_t : 1;          /*!< bit:      7  Reserved                           */
            uint32_t MODE : 1;     /*!< bit:      8  Operation Modes                    */
            uint32_t CEN : 1;      /*!< bit:      9  Clock Enable                       */
            uint32_t : 2;          /*!< bit: 10..11  Reserved                           */
            uint32_t PSEL : 4;     /*!< bit: 12..15  Prescaler Select                   */
            uint32_t LEVEL : 6;    /*!< bit: 16..21  Threshold Level                    */
            uint32_t : 10;         /*!< bit: 22..31  Reserved                           */
        } bit;                     /*!< Structure used for bit  access                  */
        uint32_t reg;              /*!< Type      used for register access              */
    } SYSCTRL_BOD33_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SYSCTRL_BOD33_OFFSET          0x34       /**< \brief (SYSCTRL_BOD33 offset) BOD33 Control Register */

#define SYSCTRL_BOD33_ENABLE_Pos      1          /**< \brief (SYSCTRL_BOD33) Enable */
#define SYSCTRL_BOD33_ENABLE          ( 0x1u << SYSCTRL_BOD33_ENABLE_Pos )
#define SYSCTRL_BOD33_HYST_Pos        2          /**< \brief (SYSCTRL_BOD33) Hysteresis Enable */
#define SYSCTRL_BOD33_HYST            ( 0x1u << SYSCTRL_BOD33_HYST_Pos )
#define SYSCTRL_BOD33_ACTION_Pos      3          /**< \brief (SYSCTRL_BOD33) Action when Threshold Crossed */
#define SYSCTRL_BOD33_ACTION_Msk      ( 0x3u << SYSCTRL_BOD33_ACTION_Pos )
#define SYSCTRL_BOD33_ACTION( value )    ( ( SYSCTRL_BOD33_ACTION_Msk & ( ( value ) << SYSCTRL_BOD33_ACTION_Pos ) ) )
#define SYSCTRL_BOD33_RUNSTDBY_Pos    6          /**< \brief (SYSCTRL_BOD33) Run during Standby */
#define SYSCTRL_BOD33_RUNSTDBY        ( 0x1u << SYSCTRL_BOD33_RUNSTDBY_Pos )
#define SYSCTRL_BOD33_MODE_Pos        8          /**< \brief (SYSCTRL_BOD33) Operation Modes */
#define SYSCTRL_BOD33_MODE            ( 0x1u << SYSCTRL_BOD33_MODE_Pos )
#define SYSCTRL_BOD33_CEN_Pos         9          /**< \brief (SYSCTRL_BOD33) Clock Enable */
#define SYSCTRL_BOD33_CEN             ( 0x1u << SYSCTRL_BOD33_CEN_Pos )
#define SYSCTRL_BOD33_PSEL_Pos        12         /**< \brief (SYSCTRL_BOD33) Prescaler Select */
#define SYSCTRL_BOD33_PSEL_Msk        ( 0xFu << SYSCTRL_BOD33_PSEL_Pos )
#define SYSCTRL_BOD33_PSEL( value )     ( ( SYSCTRL_BOD33_PSEL_Msk & ( ( value ) << SYSCTRL_BOD33_PSEL_Pos ) ) )
#define SYSCTRL_BOD33_LEVEL_Pos       16         /**< \brief (SYSCTRL_BOD33) Threshold Level */
#define SYSCTRL_BOD33_LEVEL_Msk       ( 0x3Fu << SYSCTRL_BOD33_LEVEL_Pos )
#define SYSCTRL_BOD33_LEVEL( value )    ( ( SYSCTRL_BOD33_LEVEL_Msk & ( ( value ) << SYSCTRL_BOD33_LEVEL_Pos ) ) )
#define SYSCTRL_BOD33_MASK            0x003FF35Eu /**< \brief (SYSCTRL_BOD33) MASK Register */

/* -------- SYSCTRL_BOD12 : (SYSCTRL Offset: 0x38) (R/W 32) BOD12 Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t : 1;          /*!< bit:      0  Reserved                           */
            uint32_t ENABLE : 1;   /*!< bit:      1  Enable                             */
            uint32_t HYST : 1;     /*!< bit:      2  Hysteresis Enable                  */
            uint32_t ACTION : 2;   /*!< bit:  3.. 4  Action when Threshold Crossed      */
            uint32_t : 1;          /*!< bit:      5  Reserved                           */
            uint32_t RUNSTDBY : 1; /*!< bit:      6  Run during Standby                 */
            uint32_t : 1;          /*!< bit:      7  Reserved                           */
            uint32_t MODE : 1;     /*!< bit:      8  Operation Modes                    */
            uint32_t CEN : 1;      /*!< bit:      9  Clock Enable                       */
            uint32_t : 2;          /*!< bit: 10..11  Reserved                           */
            uint32_t PSEL : 4;     /*!< bit: 12..15  Prescaler Select                   */
            uint32_t LEVEL : 5;    /*!< bit: 16..20  Threshold Level                    */
            uint32_t : 11;         /*!< bit: 21..31  Reserved                           */
        } bit;                     /*!< Structure used for bit  access                  */
        uint32_t reg;              /*!< Type      used for register access              */
    } SYSCTRL_BOD12_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SYSCTRL_BOD12_OFFSET          0x38       /**< \brief (SYSCTRL_BOD12 offset) BOD12 Control Register */

#define SYSCTRL_BOD12_ENABLE_Pos      1          /**< \brief (SYSCTRL_BOD12) Enable */
#define SYSCTRL_BOD12_ENABLE          ( 0x1u << SYSCTRL_BOD12_ENABLE_Pos )
#define SYSCTRL_BOD12_HYST_Pos        2          /**< \brief (SYSCTRL_BOD12) Hysteresis Enable */
#define SYSCTRL_BOD12_HYST            ( 0x1u << SYSCTRL_BOD12_HYST_Pos )
#define SYSCTRL_BOD12_ACTION_Pos      3          /**< \brief (SYSCTRL_BOD12) Action when Threshold Crossed */
#define SYSCTRL_BOD12_ACTION_Msk      ( 0x3u << SYSCTRL_BOD12_ACTION_Pos )
#define SYSCTRL_BOD12_ACTION( value )    ( ( SYSCTRL_BOD12_ACTION_Msk & ( ( value ) << SYSCTRL_BOD12_ACTION_Pos ) ) )
#define SYSCTRL_BOD12_RUNSTDBY_Pos    6          /**< \brief (SYSCTRL_BOD12) Run during Standby */
#define SYSCTRL_BOD12_RUNSTDBY        ( 0x1u << SYSCTRL_BOD12_RUNSTDBY_Pos )
#define SYSCTRL_BOD12_MODE_Pos        8          /**< \brief (SYSCTRL_BOD12) Operation Modes */
#define SYSCTRL_BOD12_MODE            ( 0x1u << SYSCTRL_BOD12_MODE_Pos )
#define SYSCTRL_BOD12_CEN_Pos         9          /**< \brief (SYSCTRL_BOD12) Clock Enable */
#define SYSCTRL_BOD12_CEN             ( 0x1u << SYSCTRL_BOD12_CEN_Pos )
#define SYSCTRL_BOD12_PSEL_Pos        12         /**< \brief (SYSCTRL_BOD12) Prescaler Select */
#define SYSCTRL_BOD12_PSEL_Msk        ( 0xFu << SYSCTRL_BOD12_PSEL_Pos )
#define SYSCTRL_BOD12_PSEL( value )     ( ( SYSCTRL_BOD12_PSEL_Msk & ( ( value ) << SYSCTRL_BOD12_PSEL_Pos ) ) )
#define SYSCTRL_BOD12_LEVEL_Pos       16         /**< \brief (SYSCTRL_BOD12) Threshold Level */
#define SYSCTRL_BOD12_LEVEL_Msk       ( 0x1Fu << SYSCTRL_BOD12_LEVEL_Pos )
#define SYSCTRL_BOD12_LEVEL( value )    ( ( SYSCTRL_BOD12_LEVEL_Msk & ( ( value ) << SYSCTRL_BOD12_LEVEL_Pos ) ) )
#define SYSCTRL_BOD12_MASK            0x001FF35Eu /**< \brief (SYSCTRL_BOD12) MASK Register */

/* -------- SYSCTRL_VREG : (SYSCTRL Offset: 0x3C) (R/W 16) VREG Control Register -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint16_t : 1;          /*!< bit:      0  Reserved                           */
            uint16_t ENABLE : 1;   /*!< bit:      1  Enable                             */
            uint16_t : 2;          /*!< bit:  2.. 3  Reserved                           */
            uint16_t VDDMON : 2;   /*!< bit:  4.. 5  Enable reset on core supply failure */
            uint16_t RUNSTDBY : 1; /*!< bit:      6  Run during Standby                 */
            uint16_t : 1;          /*!< bit:      7  Reserved                           */
            uint16_t LEVEL : 3;    /*!< bit:  8..10  Output Voltage Level               */
            uint16_t : 1;          /*!< bit:     11  Reserved                           */
            uint16_t CALIB : 3;    /*!< bit: 12..14  Calibration Value                  */
            uint16_t : 1;          /*!< bit:     15  Reserved                           */
        } bit;                     /*!< Structure used for bit  access                  */
        uint16_t reg;              /*!< Type      used for register access              */
    } SYSCTRL_VREG_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SYSCTRL_VREG_OFFSET          0x3C        /**< \brief (SYSCTRL_VREG offset) VREG Control Register */
#define SYSCTRL_VREG_RESETVALUE      0x0000      /**< \brief (SYSCTRL_VREG reset_value) VREG Control Register */

#define SYSCTRL_VREG_ENABLE_Pos      1           /**< \brief (SYSCTRL_VREG) Enable */
#define SYSCTRL_VREG_ENABLE          ( 0x1u << SYSCTRL_VREG_ENABLE_Pos )
#define SYSCTRL_VREG_VDDMON_Pos      4           /**< \brief (SYSCTRL_VREG) Enable reset on core supply failure */
#define SYSCTRL_VREG_VDDMON_Msk      ( 0x3u << SYSCTRL_VREG_VDDMON_Pos )
#define SYSCTRL_VREG_VDDMON( value )    ( ( SYSCTRL_VREG_VDDMON_Msk & ( ( value ) << SYSCTRL_VREG_VDDMON_Pos ) ) )
#define SYSCTRL_VREG_RUNSTDBY_Pos    6           /**< \brief (SYSCTRL_VREG) Run during Standby */
#define SYSCTRL_VREG_RUNSTDBY        ( 0x1u << SYSCTRL_VREG_RUNSTDBY_Pos )
#define SYSCTRL_VREG_LEVEL_Pos       8           /**< \brief (SYSCTRL_VREG) Output Voltage Level */
#define SYSCTRL_VREG_LEVEL_Msk       ( 0x7u << SYSCTRL_VREG_LEVEL_Pos )
#define SYSCTRL_VREG_LEVEL( value )    ( ( SYSCTRL_VREG_LEVEL_Msk & ( ( value ) << SYSCTRL_VREG_LEVEL_Pos ) ) )
#define SYSCTRL_VREG_CALIB_Pos       12          /**< \brief (SYSCTRL_VREG) Calibration Value */
#define SYSCTRL_VREG_CALIB_Msk       ( 0x7u << SYSCTRL_VREG_CALIB_Pos )
#define SYSCTRL_VREG_CALIB( value )    ( ( SYSCTRL_VREG_CALIB_Msk & ( ( value ) << SYSCTRL_VREG_CALIB_Pos ) ) )
#define SYSCTRL_VREG_MASK            0x7772u     /**< \brief (SYSCTRL_VREG) MASK Register */

/* -------- SYSCTRL_VREF : (SYSCTRL Offset: 0x40) (R/W 32) VREF Control Register A -------- */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef union
    {
        struct
        {
            uint32_t : 1;         /*!< bit:      0  Reserved                           */
            uint32_t TSEN : 1;    /*!< bit:      1  Temperature Sensor Output Enable   */
            uint32_t BGOUTEN : 1; /*!< bit:      2  Bandgap Output Enable              */
            uint32_t : 13;        /*!< bit:  3..15  Reserved                           */
            uint32_t CALIB : 11;  /*!< bit: 16..26  Voltage Reference Calibration Value */
            uint32_t : 5;         /*!< bit: 27..31  Reserved                           */
        } bit;                    /*!< Structure used for bit  access                  */
        uint32_t reg;             /*!< Type      used for register access              */
    } SYSCTRL_VREF_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define SYSCTRL_VREF_OFFSET         0x40         /**< \brief (SYSCTRL_VREF offset) VREF Control Register A */
#define SYSCTRL_VREF_RESETVALUE     0x00000000   /**< \brief (SYSCTRL_VREF reset_value) VREF Control Register A */

#define SYSCTRL_VREF_TSEN_Pos       1            /**< \brief (SYSCTRL_VREF) Temperature Sensor Output Enable */
#define SYSCTRL_VREF_TSEN           ( 0x1u << SYSCTRL_VREF_TSEN_Pos )
#define SYSCTRL_VREF_BGOUTEN_Pos    2            /**< \brief (SYSCTRL_VREF) Bandgap Output Enable */
#define SYSCTRL_VREF_BGOUTEN        ( 0x1u << SYSCTRL_VREF_BGOUTEN_Pos )
#define SYSCTRL_VREF_CALIB_Pos      16           /**< \brief (SYSCTRL_VREF) Voltage Reference Calibration Value */
#define SYSCTRL_VREF_CALIB_Msk      ( 0x7FFu << SYSCTRL_VREF_CALIB_Pos )
#define SYSCTRL_VREF_CALIB( value )    ( ( SYSCTRL_VREF_CALIB_Msk & ( ( value ) << SYSCTRL_VREF_CALIB_Pos ) ) )
#define SYSCTRL_VREF_MASK           0x07FF0006u  /**< \brief (SYSCTRL_VREF) MASK Register */

/** \brief SYSCTRL hardware registers */
#if !( defined( __ASSEMBLY__ ) || defined( __IAR_SYSTEMS_ASM__ ) )
    typedef struct
    {
        __IO SYSCTRL_INTENCLR_Type INTENCLR;   /**< \brief Offset: 0x00 (R/W 32) Interrupt Enable Clear Register */
        __IO SYSCTRL_INTENSET_Type INTENSET;   /**< \brief Offset: 0x04 (R/W 32) Interrupt Enable Set Register */
        __IO SYSCTRL_INTFLAG_Type INTFLAG;     /**< \brief Offset: 0x08 (R/W 32) Interrupt Flag Status and Clear Register */
        __I SYSCTRL_PCLKSR_Type PCLKSR;        /**< \brief Offset: 0x0C (R/  32) Power and Clocks Status Register */
        __IO SYSCTRL_XOSC_Type XOSC;           /**< \brief Offset: 0x10 (R/W 16) XOSC Control Register */
        RoReg8 Reserved1[ 0x2 ];
        __IO SYSCTRL_XOSC32K_Type XOSC32K;     /**< \brief Offset: 0x14 (R/W 16) XOSC32K Control Register */
        RoReg8 Reserved2[ 0x2 ];
        __IO SYSCTRL_OSC32K_Type OSC32K;       /**< \brief Offset: 0x18 (R/W 32) OSC32K Control Register */
        __IO SYSCTRL_OSCULP32K_Type OSCULP32K; /**< \brief Offset: 0x1C (R/W  8) OSCULP32K Control Register */
        RoReg8 Reserved3[ 0x3 ];
        __IO SYSCTRL_OSC8M_Type OSC8M;         /**< \brief Offset: 0x20 (R/W 32) OSC8M Control Register A */
        __IO SYSCTRL_DFLLCTRL_Type DFLLCTRL;   /**< \brief Offset: 0x24 (R/W 16) DFLL Config Register */
        RoReg8 Reserved4[ 0x2 ];
        __IO SYSCTRL_DFLLVAL_Type DFLLVAL;     /**< \brief Offset: 0x28 (R/W 32) DFLL Calibration Value Register */
        __IO SYSCTRL_DFLLMUL_Type DFLLMUL;     /**< \brief Offset: 0x2C (R/W 32) DFLL Multiplier Register */
        __IO SYSCTRL_DFLLSYNC_Type DFLLSYNC;   /**< \brief Offset: 0x30 (R/W  8) DFLL Synchronization Register */
        RoReg8 Reserved5[ 0x3 ];
        __IO SYSCTRL_BOD33_Type BOD33;         /**< \brief Offset: 0x34 (R/W 32) BOD33 Control Register */
        __IO SYSCTRL_BOD12_Type BOD12;         /**< \brief Offset: 0x38 (R/W 32) BOD12 Control Register */
        __IO SYSCTRL_VREG_Type VREG;           /**< \brief Offset: 0x3C (R/W 16) VREG Control Register */
        RoReg8 Reserved6[ 0x2 ];
        __IO SYSCTRL_VREF_Type VREF;           /**< \brief Offset: 0x40 (R/W 32) VREF Control Register A */
    } Sysctrl;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAMD20_SYSCTRL_COMPONENT_ */
